uhnp/src/InformationRegisters/СчетаУчетаЗадолженностиИРезервов/СчетаУчетаЗадолженностиИРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаУчетаЗадолженностиИРезервов</name>
  <resources>
    <name>СчетРезерва</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетОбесцененнойЗадолженности</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасхода</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасходаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасходаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасходаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетДолгосрочнойЗадолженности</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетОбесцененнойДолгосрочнойЗадолженности</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетРезерваДляДолгосрочнойЗадолженности</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <dimensions>
    <name>СчетЗадолженности</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СчетаУчетаЗадолженностиИРезервов/ManagerModule.bsl
Функция ПолучитьИменаСубонто() Экспорт 

	Результат = Новый Структура;
	
	Результат.Вставить("СчетЗадолженности", 						Новый Соответствие);
	Результат.Вставить("СчетРезерва", 								Новый Соответствие);
	Результат.Вставить("СчетОбесцененнойЗадолженности", 			Новый Соответствие);
	Результат.Вставить("СчетДолгосрочнойЗадолженности", 			Новый Соответствие);
	Результат.Вставить("СчетОбесцененнойДолгосрочнойЗадолженности", Новый Соответствие);
	Результат.Вставить("СчетРезерваДляДолгосрочнойЗадолженности", 	Новый Соответствие);
		
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетРасходаСубконто1");
	Субконто.Вставить(2, "СчетРасходаСубконто2");
	Субконто.Вставить(3, "СчетРасходаСубконто3");
	
	Результат.Вставить("СчетРасхода", Субконто);	
	
	Возврат Результат;
	
КонецФункции
